# SaveOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SaveOptions Class
Members See Also
---
This class contains options available for saving a document to disk.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class SaveOptions : IDisposable
```

Visual Basic
---
```text
Public Class SaveOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SaveOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SaveOptions
# See Also
SaveOptions Members
Autodesk.Revit.DB Namespace